org-info/emacs_com/emacs_GTD.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-02-12 Sun 09:33 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>GTD &amp;&amp; org-mode</title>
<meta name="generator" content="Org mode" />


</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="../emacs.html"> UP </a>
 |
 <a accesskey="H" href="/"> HOME </a>
</div><div id="content">
<h1 class="title">GTD &amp;&amp; org-mode</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orge87bcd9">1. 为什么要用GTD</a></li>
<li><a href="#org92dfc37">2. GTD是什么</a>
<ul>
<li><a href="#org4ebb8bf">2.1. 人生5楼</a></li>
<li><a href="#org09403e3">2.2. GTD是什么</a></li>
</ul>
</li>
<li><a href="#orgf4ba13c">3. GTD怎么实现</a></li>
<li><a href="#org5eee65e">4. org mode怎么实现GTD</a>
<ul>
<li><a href="#org79040cf">4.1. 需求分析</a></li>
<li><a href="#orgce7c095">4.2. 思路的设计</a></li>
<li><a href="#org824e9a5">4.3. 流程的设计</a></li>
<li><a href="#orgd00c8a6">4.4. 文件的设计</a></li>
<li><a href="#orga0f617e">4.5. <span class="todo TODO">TODO</span> 的设计</a></li>
<li><a href="#orged76706">4.6. TAGS的设计</a></li>
<li><a href="#org3badea7">4.7. PROPERTY的设计</a></li>
<li><a href="#orgd1a94eb">4.8. Effort的设计</a></li>
<li><a href="#org67928ef">4.9. clock的设计</a></li>
<li><a href="#orgf384b95">4.10. capture设计</a></li>
<li><a href="#org4114355">4.11. refile的设计</a></li>
<li><a href="#orgfc201fe">4.12. archive的设计</a></li>
<li><a href="#org67cb645">4.13. Agent的设计</a></li>
<li><a href="#orgdb1f2e7">4.14. 使用流程</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orge87bcd9" class="outline-2">
<h2 id="orge87bcd9"><span class="section-number-2">1</span> 为什么要用GTD</h2>
<div class="outline-text-2" id="text-1">
<p>
每天或每周需要处理的事情非常之多, 小到晚上要洗衣服, 大到明天项目交付. 这些事情如果都存储在脑中, 轻则
焦虑不堪, 重则脑子爆炸. 而且脑中一旦塞满了这类事情, 非常不利于思考. 大脑应该是拿来思考的, 而不是用来存
储的. 假设一种情形, 大脑只用来思考, 而存储则放在大脑之外, 那么我们就不必因当下之外的事情而焦虑, 能够更
专一的处理当下的问题. 同时, 如果外在存储能够提醒我们何时该思考何问题, 那么我们也不会因错过了某事而悔恨
,比如女友生日. 而这也是GTD的目的所在, 大脑只用来思考, 存储在脑外.
</p>
</div>
</div>
<div id="outline-container-org92dfc37" class="outline-2">
<h2 id="org92dfc37"><span class="section-number-2">2</span> GTD是什么</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org4ebb8bf" class="outline-3">
<h3 id="org4ebb8bf"><span class="section-number-3">2.1</span> 人生5楼</h3>
<div class="outline-text-3" id="text-2-1">
<p>
了解GTD之前, 必须了解人生5楼.
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">楼数</th>
<th scope="col" class="org-left">功能</th>
<th scope="col" class="org-left">说明</th>
<th scope="col" class="org-left">备注</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">5楼</td>
<td class="org-left">人生规划</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">4楼</td>
<td class="org-left">3年目标</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">3楼</td>
<td class="org-left">1年目标</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">2楼</td>
<td class="org-left">职责范围</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">1楼</td>
<td class="org-left">项目</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">GTD管理</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">地面</td>
<td class="org-left">行动清单</td>
<td class="org-left">归属1楼</td>
<td class="org-left">GTD管理</td>
</tr>
</tbody>
</table>

<p>
把人生(或部分人生)比喻成一座大厦, 1楼是我们当下要做的事情, 2楼是我们的职责范围, 3楼是我们1年后的样
子, 4楼是我们3年后的样子, 5楼是我们人生(10年, 20年或一辈子)的规划.
</p>

<p>
<span class="underline">我们的人生是高层决定了低层</span>. 比如, 如果想成为计算机专家(5楼), 那么3年后要先成为工程师(4楼), 1年后
要先成为程序员(3楼). 为了要成为程序员, 也许我们需要去报班学习(2楼职责为学习),或者成为程序员助理(2楼职
责为搬砖). 而1楼则是我们当下要确确实实需要处理的事情, 比如看书, 工作, 与同事交流等, 所有一切能对我们有
提升的事情.
</p>

<p>
<span class="underline">大厦是由低到高建造的</span>. 千里之行, 始于足下. 1楼的行为直接决定了能否达到后面的楼层.
</p>

<p>
大厦最难的地方不在于实现5楼的规划, 而在于制定5楼的规划. 不过这也正是人生的魅力所在吧.
</p>
</div>
</div>
<div id="outline-container-org09403e3" class="outline-3">
<h3 id="org09403e3"><span class="section-number-3">2.2</span> GTD是什么</h3>
<div class="outline-text-3" id="text-2-2">
<p>
GTD全名Getting things done, 它只是一种思想, 所能管理的是大厦的1楼.
它的核心目的: 事物存储在脑外, 大脑用来思考.
</p>

<p>
GTD的工作流程(算法)甚至文件(结构)都是可以自定义的. 适合的才是最好的.
</p>

<p>
吐槽: 中文译本《Getting things done》满篇废话.
</p>
</div>
</div>
</div>
<div id="outline-container-orgf4ba13c" class="outline-2">
<h2 id="orgf4ba13c"><span class="section-number-2">3</span> GTD怎么实现</h2>
<div class="outline-text-2" id="text-3">
<p>
GTD的实现方式非常之多, 有很多软件工具. 最喜欢的还是org-mode(emacs 插件).
</p>
</div>
</div>
<div id="outline-container-org5eee65e" class="outline-2">
<h2 id="org5eee65e"><span class="section-number-2">4</span> org mode怎么实现GTD</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-org79040cf" class="outline-3">
<h3 id="org79040cf"><span class="section-number-3">4.1</span> 需求分析</h3>
<div class="outline-text-3" id="text-4-1">
<p>
所有的设计都是基于需求的, 应该先有需求, 再去设计.
当前的需求:
</p>
<ol class="org-ol">
<li>有哪些task
<ul class="org-ul">
<li class="on"><code>[X]</code> 他们归属于哪个PROJECT</li>
<li class="on"><code>[X]</code> 他们的四象限: 紧急&amp;&amp;重要</li>
<li class="on"><code>[X]</code> 工作量预估</li>
<li class="off"><code>[&#xa0;]</code> <p>
关联性 A task可能与B, C相关联
</p>
<pre class="example">
TODO 该任务并未完成

</pre></li>
</ul></li>
<li>当前正在处理的任务
尽可能的关注当前, 忽略其他</li>
<li>当某个task进行时, 快速capture我的想法, 并且自动refile</li>
<li>看到自己花费的时间
<ul class="org-ul">
<li class="on"><code>[X]</code> 一天,一周都做了什么</li>
<li class="on"><code>[X]</code> 某个PROJECT总共花费的时间</li>
</ul></li>
</ol>
</div>
</div>

<div id="outline-container-orgce7c095" class="outline-3">
<h3 id="orgce7c095"><span class="section-number-3">4.2</span> 思路的设计</h3>
<div class="outline-text-3" id="text-4-2">
<p>
5楼 到 地面视角
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">楼数</th>
<th scope="col" class="org-left">功能</th>
<th scope="col" class="org-left">说明</th>
<th scope="col" class="org-left">备注</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">5楼</td>
<td class="org-left">人生规划</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">4楼</td>
<td class="org-left">3年目标</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">3楼</td>
<td class="org-left">1年目标</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">2楼</td>
<td class="org-left">职责范围</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">1楼</td>
<td class="org-left">项目</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">GTD管理</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">地面</td>
<td class="org-left">行动清单</td>
<td class="org-left">隶属1楼</td>
<td class="org-left">GTD管理</td>
</tr>
</tbody>
</table>
<p>
备注 : GTD管理的其实是 1楼 &amp;&amp; 地面的清单
</p>
</div>
</div>

<div id="outline-container-org824e9a5" class="outline-3">
<h3 id="org824e9a5"><span class="section-number-3">4.3</span> 流程的设计</h3>
<div class="outline-text-3" id="text-4-3">
<pre class="example">
-------------------------+------------------------
			 |
			 | capture (easy)
			 |
			 |
			 v
     archive        +---------+
+-------------------|  inbox  |
|                   +----+----+
|                        |
|                        | refile (auto)
|                        |
|                        |
|       |----------------+--------------------|
|       |                |                    |
|       |                v                    v
|       v           +---------+          +---------+
|  +---------+      | my/emacs|          | work/qy |
|  |  task   |      |  * emacs|          |  * ker  |
|  +----+----+      |  * org  |          |  * frame|
|       |           |  * ccIDE|          |  * sub  |
|       |           +---------+          +---------+
|       |
|       | archive (auto)
|       |
|       v
|  +---------+
+-&gt;| archive |
   +----+----+
</pre>
</div>
</div>
<div id="outline-container-orgd00c8a6" class="outline-3">
<h3 id="orgd00c8a6"><span class="section-number-3">4.4</span> 文件的设计</h3>
<div class="outline-text-3" id="text-4-4">
<p>
区分目录是为了更好的给PROJECT做分类处理, 使后续的统计查看更方便. 比如org-agenda `R统计时间
gtd<sub>common中保存的是一些通用的</sub>, 可能暂时不好归类的PROJECT以及一系列TODO任务.
而gtd<sub>my与gtd</sub><sub>work则是已经明确分类的PROJECT</sub>.
比如gtd<sub>my</sub>/emacs.org明确的是与emacs有关的任务.
但即使都是emacs相关, 也可分为是emacs自身, org, 还是cc-IDE.
所以emacs.org中实际包含了上面三个PROJECT.
</p>
<pre class="example">
* emacs
* org
* ccIDE
</pre>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">目录</th>
<th scope="col" class="org-left">说明</th>
<th scope="col" class="org-left">备注</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">gtd<sub>common</sub></td>
<td class="org-left">通用gtd流程文件</td>
<td class="org-left">inbox.org</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">task.org</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">archive.org</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">gtd<sub>my</sub></td>
<td class="org-left">自己的project files</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">gtd<sub>work</sub></td>
<td class="org-left">工作的project files</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>

<p>
gtd<sub>common中的文件</sub>:
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">文件名</th>
<th scope="col" class="org-left">说明</th>
<th scope="col" class="org-left">备注</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">inbox.org</td>
<td class="org-left">收集箱</td>
<td class="org-left">不区分时间, 不区分场景</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">灵光一闪即可扔进去保存</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">task.org</td>
<td class="org-left">任务清单</td>
<td class="org-left">1. priority标签</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">task</td>
<td class="org-left">2. 四象限约束</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">项目清单</td>
<td class="org-left">1. 凡是steps&gt;1的都属于项目</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">project</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">archive.org</td>
<td class="org-left">参考资料</td>
<td class="org-left">1. 有参考价值的东西</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">2. 垃圾箱</td>
</tr>
</tbody>
</table>
<p>
备注:
</p>
<ol class="org-ol">
<li>task 与 project的唯一区别
task只有one step,  project的steps &gt; 1</li>
<li>文件都是通过流程来操作的, 不应该手动去干预</li>
</ol>
</div>
</div>

<div id="outline-container-orga0f617e" class="outline-3">
<h3 id="orga0f617e"><span class="section-number-3">4.5</span> <span class="todo TODO">TODO</span> 的设计</h3>
<div class="outline-text-3" id="text-4-5">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">名称</th>
<th scope="col" class="org-left">功能</th>
<th scope="col" class="org-left">备注</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">TODO</td>
<td class="org-left">等待自己处理</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">WAITTING</td>
<td class="org-left">等待他人完成</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">DONE</td>
<td class="org-left">完成</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">CANCEL</td>
<td class="org-left">取消</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>
<p>
备注:
</p>
<ol class="org-ol">
<li>针对的对象是下一步行动清单</li>
<li>project中的下一步行动即是最上层的行动;
task中的下一步行动是依据四象限法则来确定的.</li>
<li>TODO与WAITTING的含义, 表示该行动正在或即将处理</li>
</ol>
</div>
</div>

<div id="outline-container-orged76706" class="outline-3">
<h3 id="orged76706"><span class="section-number-3">4.6</span> TAGS的设计</h3>
<div class="outline-text-3" id="text-4-6">
<p>
四象限使用proirity来区分;
TAGS为之后快速查找使用
</p>
</div>
</div>

<div id="outline-container-org3badea7" class="outline-3">
<h3 id="org3badea7"><span class="section-number-3">4.7</span> PROPERTY的设计</h3>
<div class="outline-text-3" id="text-4-7">
<p>
当前主要使用的字段
</p>
<ol class="org-ol">
<li>P<sub>UUID</sub>
PROEJCT item的标志, 主要影响auto refile</li>
<li><p>
HIDE<sub>WHEN</sub><sub>STUCK</sub>
PROJECT item的属性, 控制了是否在agenda中显示
有些PROJECT是长久开启的, 不会关闭. 比如emacs
当这类PROJECT没有task时, 就变成了STUCK项目. 但我们并不希望将这类PROJECT在agenda中显示.
所以有了HIDE<sub>WHEN</sub><sub>STUCK</sub>.
</p>

<pre class="example">
+------------+----------------+
|  not stuck |  stuck project |
|            |                |
|            |   +---+        |
|            |   |   |        |
|            |   |   +--------+--------&gt; stuck but also hide
|            |   +---+        |          HIDE_WHEN_STUCK
|            |                |
|            |                |
+------------+----------------+
</pre></li>
</ol>
</div>
</div>
<div id="outline-container-orgd1a94eb" class="outline-3">
<h3 id="orgd1a94eb"><span class="section-number-3">4.8</span> Effort的设计</h3>
<div class="outline-text-3" id="text-4-8">
<p>
effort是自己对某个task工作量的预估, 与clock-sum-time比对, 可以很好的进行分析.
为了方便的effort, 这里只在两处设计了提示:
</p>
<ol class="org-ol">
<li>capture的时候, 可以输入effort. 当然为了快速capture, 这里允许输入0跳过</li>
<li>clock-in的时候, 如果item effort还是0, 则会要求进入工作预估</li>
</ol>
</div>
</div>
<div id="outline-container-org67928ef" class="outline-3">
<h3 id="org67928ef"><span class="section-number-3">4.9</span> clock的设计</h3>
<div class="outline-text-3" id="text-4-9">
<p>
org的clock已经非常好用了. 这里只是做了一点点修改:
</p>
<ol class="org-ol">
<li>快捷键快速clock-in, clock-out</li>
<li>如果当前没有clock, 会在agenda界面做个提示</li>
</ol>
</div>
</div>

<div id="outline-container-orgf384b95" class="outline-3">
<h3 id="orgf384b95"><span class="section-number-3">4.10</span> capture设计</h3>
<div class="outline-text-3" id="text-4-10">
<p>
经常是在工作的时候, 突然有了某个想法. 这个想法也许值得记录, 但不要打断当前的思路. 所以需要capture
capture应该是快速的, 但又要明确的(归属要明确, 最好effort要明确)
</p>

<p>
为了快速capture, 所以不应该考虑这个想法应该放到哪个file. 统一放到inbox即可.
为了后面的auto refile, 这个想法或item 应该携带足够的信息, 可以完成auto refile.
这里的办法是给item一个tag.
比如 capture了一个item, 再给其增加对应的tag
</p>
<pre class="example">
* org应该快速capture :org:

</pre>
<p>
这样就表明了这是一个与org PROJECT有关的task
</p>
</div>
</div>
<div id="outline-container-org4114355" class="outline-3">
<h3 id="org4114355"><span class="section-number-3">4.11</span> refile的设计</h3>
<div class="outline-text-3" id="text-4-11">
<p>
refile应该是自动完成的, 不应该手动
为了自动完成, item已经给了相关信息(tag)
在gtd<sub>my或gtd</sub><sub>work的PROJECT中</sub>, 也应该携带足够的信息去与该tag匹配. 只有匹配成功了, 就可以auto-refile
这里的办法是给PROJECT item一个Property (P<sub>UUID</sub>)来实现
比如
</p>
<pre class="example">
* PROJECT org                                                       :org:
  :PROPERTIES:
  :P_UUID:   org
  :END:
</pre>
<p>
当capute-item的tag 与 PROJECT-item的P<sub>UUID相匹配的时候</sub>, 会自动refile
</p>
</div>
</div>
<div id="outline-container-orgfc201fe" class="outline-3">
<h3 id="orgfc201fe"><span class="section-number-3">4.12</span> archive的设计</h3>
<div class="outline-text-3" id="text-4-12">
<p>
对于gtd<sub>my</sub>, gtd<sub>work中的task</sub>, 没必要archive
对于gtd<sub>common中的task</sub>, 应该自动archive
</p>
</div>
</div>

<div id="outline-container-org67cb645" class="outline-3">
<h3 id="org67cb645"><span class="section-number-3">4.13</span> Agent的设计</h3>
<div class="outline-text-3" id="text-4-13">
<p>
agent的目的有2个:
</p>
<ol class="org-ol">
<li>查看各种代办事项
今天的, 未来的, TODO的, inbox中的</li>
<li>统计信息
一是以time为视角的统计, 比如今天或这周做了哪些TODO或PROJECT
二是以PROJECT为视角的统计. 比如统计emacs PROJECT花费的时间</li>
</ol>


<p>
查看代办事项, 主要是org-agenda-view, org-next-view, org-inbox-view 查看
查看统计信息, 主要是org-project-view, org-archive-view 以及在特定PROJECT file中的org-colmun-view查看具体
</p>


<p>
快捷键主要是为了方便.比如
</p>
<ul class="org-ul">
<li>空格滚动各种view</li>
<li>tab在另一个窗口显示item narrow</li>
<li>enter则进入item编辑</li>
<li>常用的功能都会放到C-j中处理 等等</li>
</ul>
</div>
</div>

<div id="outline-container-orgdb1f2e7" class="outline-3">
<h3 id="orgdb1f2e7"><span class="section-number-3">4.14</span> 使用流程</h3>
<div class="outline-text-3" id="text-4-14">
<pre class="example">
|
| capture with                                         add timestamp &amp;&amp;              add DONE &amp;&amp;
| template       +---------+ auto refile   +---------+   auto refile     +---------+ auto archive  +---------+
+---------------&gt;|  inbxo  |--------------&gt;|next step|------------------&gt;|  agenda |--------------&gt;| archive |
|  C-c c         +---+-----+               +---------+  C-j s,d          +---------+  C-j t        +---------+
|                    |                                                                                  ^
|                    |                       add DONE &amp;&amp; auto refile                                    |
|                    +----------------------------------------------------------------------------------+
|                                                  C-j t
</pre>

<ol class="org-ol">
<li><p>
C-c c   -&gt; inbox
</p>
<pre class="example">
info, todo, waiting, project 都会放到inbox

</pre></li>
<li>当打开org-agenda(主动调用"r")或者在org-agenda中按'r' 会自动把inbox中的文件refile到指定位置</li>
<li>在org-agenda界面操控
C-j 以及常用的快捷键 t, space, tab, enter等</li>
<li>org-agenda界面的'r'动作, 不仅可以把inbox中的文件reflie, 也可以把task.org中完成的任务archive</li>
<li><p>
其实还有最后一步, 即把archive中的内容输出到blog中
</p>
<pre class="example">
blog具体见 hugo的文档
不建议删除已完成或cancel的task. 后期统计可以使用

</pre></li>
</ol>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2023-02-12 Sun 09:33</p>
<p class="validation"></p>
</div>
</body>
</html>
